{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.9", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "dtype": "int32", "batch_input_shape": [null, 14], "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "batch_input_shape": [null, 14], "dtype": "float32", "activity_regularizer": null, "embeddings_regularizer": null, "name": "embedding_1", "mask_zero": false, "input_dim": 5, "trainable": false, "input_length": 14, "output_dim": 4, "embeddings_constraint": null}, "name": "embedding_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"go_backwards": false, "recurrent_constraint": null, "recurrent_regularizer": null, "bias_constraint": null, "name": "lstm_1", "recurrent_dropout": 0.0, "units": 8, "return_state": false, "bias_regularizer": null, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "stateful": false, "kernel_regularizer": null, "implementation": 1, "activation": "tanh", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "unit_forget_bias": true, "dropout": 0.0}, "name": "lstm_1", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "units": 1, "activation": "sigmoid", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}, "name": "dense_1", "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}], "output_layers": [["dense_1", 0, 0]]}}